# -*- mode: org; org-confirm-babel-evaluate: nil; org-babel-noweb-wrap-start: "«"; org-babel-noweb-wrap-end: "»"; -*-
#+LATEX_CLASS: epj-svjour

#+TITLE: Title Goes Here

#+SUBTITLE: Subtitle Goes Here

#+CALL: export-epj-latex-block()

*** get-title-text

#+NAME: get-title-text
#+BEGIN_SRC elisp 
  (format "%s" (car (plist-get (org-export-get-environment) ':title)))
#+END_SRC

#+RESULTS: get-title-text
: Title Goes Here

*** get-subtitle-text

#+NAME: get-subtitle-text
#+BEGIN_SRC elisp  :results replace :var keyword="subtitle" :var delimiter=" "
 (mapconcat 'car (org-element-map
      (org-element-parse-buffer)
      '(keyword)
    (lambda (x) (if (string= (upcase keyword) (org-element-property :key x))
                 (list (org-element-property :value x)) )
      )
    ) delimiter)
#+END_SRC

#+RESULTS: get-subtitle-text
: Subtitle Goes Here

*** get-abstract-text

#+NAME: get-abstract-text
#+BEGIN_SRC elisp :results replace :var keyword="abstract"
  (org-element-map (org-element-map
                       (org-element-parse-buffer)
                       '(headline)
                     (lambda (hl) (if (string= (upcase keyword) (upcase (org-element-property :raw-value hl)))
                                     hl)
                       ) 
                     nil t)
      '(paragraph)
    (lambda (p) 
      (format "%s" (replace-regexp-in-string (rx (or (: bos (* (any " \t\n")))
                                                     (: (* (any " \t\n")) eos)))
                                             ""
                                (buffer-substring-no-properties (org-element-property :contents-begin p) (org-element-property :contents-end p))))
      )
    nil t)
#+END_SRC

#+RESULTS: get-abstract-text
: The abstract goes here.

*** epj-pacs-codes-latex 

#+NAME: epj-pacs-codes-latex
#+BEGIN_SRC elisp  :var pacs_codes=pacs-codes-table :results latex replace :var join_delim="   \\and\n"
  (mapconcat 'identity (mapcar (lambda (x) (format "      {%s}{%s}" (car x) (nth 1 x))) pacs_codes) join_delim)
#+END_SRC

#+RESULTS: epj-pacs-codes-latex
#+BEGIN_EXPORT latex
      {PACS-key01}{Text Describing PACS-key01}   \and
      {PACS-key02}{Text Describing PACS-key02}
#+END_EXPORT

*** epj-authors-latex 

#+NAME: epj-authors-latex
#+BEGIN_SRC elisp  :var authors=authors-table :results latex replace :var join_delim=" \\and "
  (mapconcat 'identity (mapcar (lambda (x) (format "%s\\inst{%s}" (car x) (nth 2 x))) authors) join_delim)
#+END_SRC

#+RESULTS: epj-authors-latex
#+BEGIN_EXPORT latex
Mai Deah\inst{1} \and Arthur Secondus\inst{1} \and E. Tal\inst{2}
#+END_EXPORT

*** epj-institutions-latex 

#+NAME: epj-institutions-latex
#+BEGIN_SRC elisp  :var institutions=institutions-table :results latex replace :var join_delim=" \\and "
  (mapconcat 'identity (mapcar (lambda (x) (format "%s" (nth 1 x))) institutions) join_delim)
#+END_SRC

#+RESULTS: epj-institutions-latex
#+BEGIN_EXPORT latex
New Discoveries Lab, Department of Something-or-Ruther, University of Some-Sort, Some-Sort, Some-Sort-of-Country \and Golden Opportunities Lab, Department of Obscure Studies, Ancient College, Olde-Locale, Stodgy-Land
#+END_EXPORT

